@echo off
title LOVE FOR XXX
color cf
mode con cols=90 lines=40
echo.
echo                              这是我写给最最亲爱的XXX的
ping -n 1 127.0.0.1>nul
echo                                         *
ping -n 1 127.0.0.1>nul
echo                                         *
ping -n 1 127.0.0.1>nul
echo                                         *
ping -n 1 127.0.0.1>nul
echo                                         *
ping -n 1 127.0.0.1>nul
echo                        ...我想你了，我会把目光投到很远的地方...
ping -n 3 127.0.0.1>nul
echo                 ...如果我想你了，我会用拇指在手机上飞速的打下一连串的问候...
ping -n 3 127.0.0.1>nul
echo                           ...如果我想你了，我会深吸一口气...
ping -n 3 127.0.0.1>nul
echo                     ...把弥漫了你味道的空气吸进离心脏最近的地方...
ping -n 3 127.0.0.1>nul
echo                  ...如果我想你了，我会把想念换作音符，让它在指尖流露...
ping -n 3 127.0.0.1>nul
echo              ...如果我想你了，我会瞎想，想着这样的自己，能否匹配这样的你...
ping -n 3 127.0.0.1>nul
echo                                 ...我想，我已经上瘾了...
ping -n 3 127.0.0.1>nul
echo                                  ...戒不掉的，就是你...
ping -n 3 127.0.0.1>nul
echo             ...有时候想念到自己也没办法控制的时候，就很期待的想早点见到你...
ping -n 3 127.0.0.1>nul
echo                      ...想想走过的这两年，一起经历了那么多的风风雨雨...
ping -n 3 127.0.0.1>nul
echo                      ...每当回首那些，很幸运和你的相爱并对我不离不弃...
ping -n 3 127.0.0.1>nul
echo                       ...所以，纵使你在我身边，我也无时无刻不在想你...
ping -n 3 127.0.0.1>nul
cls
echo                                      ...情人节快乐哦...
ping -n 3 127.0.0.1>nul
echo                                       ...有没有感动...
ping -n 3 127.0.0.1>nul
echo                                         ...接下来...
ping -n 3 127.0.0.1>nul
echo                                           ...5...
ping -n 3 127.0.0.1>nul
echo                                           ...4...
ping -n 3 127.0.0.1>nul
echo                                           ...3...
ping -n 3 127.0.0.1>nul
echo                                           ...2...
ping -n 3 127.0.0.1>nul
echo                                           ...1...
ping -n 3 127.0.0.1>nul
cls
mode con cols=75 lines=28
echo.
echo                    *********               *********
ping -n 1 127.0.0.1>nul
echo                ****************           *****************
ping -n 1 127.0.0.1>nul
echo           **********************       ************************
ping -n 1 127.0.0.1>nul
echo        ***********************************************************
ping -n 1 127.0.0.1>nul
echo      ***************************************************************
ping -n 1 127.0.0.1>nul
echo     *****************************************************************
ping -n 1 127.0.0.1>nul
echo    -------------------------------------------------------------------
ping -n 1 127.0.0.1>nul
echo                                亲爱的XXX
ping -n 1 127.0.0.1>nul
echo     -----------------------------------------------------------------
ping -n 1 127.0.0.1>nul
echo      ******** 我 ***************************************************
ping -n 1 127.0.0.1>nul
echo        *************** 爱 ****************************************
ping -n 1 127.0.0.1>nul
echo          ********************* 你 ******************************
ping -n 1 127.0.0.1>nul
echo            *****************，********************************
ping -n 1 127.0.0.1>nul
echo              ***********************************************
ping -n 1 127.0.0.1>nul
echo                ********* 一 ******************************
ping -n 1 127.0.0.1>nul
echo                  ********** 生 *************************
ping -n 1 127.0.0.1>nul
echo                    *********** 一 ********************
ping -n 1 127.0.0.1>nul
echo                      ************ 世 ***************
ping -n 1 127.0.0.1>nul
echo                        **************！***********
ping -n 1 127.0.0.1>nul
echo                          ***********************
ping -n 1 127.0.0.1>nul
echo                            *******************
ping -n 1 127.0.0.1>nul
echo                              ***************
ping -n 1 127.0.0.1>nul
echo                                ***********
ping -n 1 127.0.0.1>nul
echo                                  *******
ping -n 1 127.0.0.1>nul
echo                                    ***
ping -n 1 127.0.0.1>nul
echo                                     * 
ping -n 1 127.0.0.1>nul
:start
set /a dj=%random%%%9
color %dj%f
ping -n 1.7 127.0.0.1>nul
goto start
Pause
